Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.2.63/samha0ab/edc/ATSAMHA0E16AB.PIC
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="SCALER1" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x42004421">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Scaler Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3DE" edc:_addr="0x42004422"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="nn-nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xDF" edc:_addr="0x42004801">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="EOEN" edc:nzwidth="0x1" edc:desc="External Output Enable"/>
            <edc:SFRFieldDef edc:cname="IOEN" edc:nzwidth="0x1" edc:desc="Internal Output Enable"/>
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="VPD" edc:nzwidth="0x1" edc:desc="Voltage Pump Disable"/>
            <edc:SFRFieldDef edc:cname="BDWP" edc:nzwidth="0x1" edc:desc="Bypass DATABUF Write Protection"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:nzwidth="0x2" edc:desc="Reference Selection">
              <edc:SFRFieldSemantic edc:cname="INT1V" edc:desc="Internal 1.0V reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AVCC" edc:desc="AVCC" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="VREFP" edc:desc="External reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x42004802">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x42004803"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004805">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x42004806">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:nzwidth="0x1" edc:desc="Underrun"/>
            <edc:SFRFieldDef edc:cname="EMPTY" edc:nzwidth="0x1" edc:desc="Data Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="r-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x42004807">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:nzwidth="0x1" edc:desc="Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DATA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x42004808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Data value to be converted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200480A"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DATABUF" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x4200480C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATABUF" edc:nzwidth="0x10" edc:desc="Data Buffer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:DeviceIDSector edc:regionid="devid" edc:beginaddr="0x41002018" edc:endaddr="0x4100201C" edc:value="0x1001158F" edc:mask="0xFFFFF0FF"/>
    <edc:RegisterMap edc:id="RTC/MODE0">
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="CTRL" edc:nzwidth="0x10" edc:access="----nnnnn---nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF8F" edc:addr="0x40001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x2" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Mode 0: 32-bit Counter" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Mode 1: 16-bit Counter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK" edc:desc="Mode 2: Clock/Calendar" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MATCHCLR" edc:nzwidth="0x1" edc:desc="Clear on Match"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x4" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_RTC_CNT = GCLK_RTC/1" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_RTC_CNT = GCLK_RTC/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_RTC_CNT = GCLK_RTC/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_RTC_CNT = GCLK_RTC/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_RTC_CNT = GCLK_RTC/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_RTC_CNT = GCLK_RTC/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_RTC_CNT = GCLK_RTC/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_RTC_CNT = GCLK_RTC/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_RTC_CNT = GCLK_RTC/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="CLK_RTC_CNT = GCLK_RTC/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_RTC_CNT = GCLK_RTC/1024" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="EVCTRL" edc:nzwidth="0x10" edc:access="n------nnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x81FF" edc:addr="0x40001404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="PEREO0" edc:nzwidth="0x1" edc:desc="Periodic Interval 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO1" edc:nzwidth="0x1" edc:desc="Periodic Interval 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO2" edc:nzwidth="0x1" edc:desc="Periodic Interval 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO3" edc:nzwidth="0x1" edc:desc="Periodic Interval 3 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO4" edc:nzwidth="0x1" edc:desc="Periodic Interval 4 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO5" edc:nzwidth="0x1" edc:desc="Periodic Interval 5 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO6" edc:nzwidth="0x1" edc:desc="Periodic Interval 6 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="PEREO7" edc:nzwidth="0x1" edc:desc="Periodic Interval 7 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="CMPEO0" edc:nzwidth="0x1" edc:desc="Compare 0 Event Output Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:nzwidth="0x1" edc:desc="Overflow Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="nn-----n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC1" edc:addr="0x40001406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="nn-----n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xC1" edc:addr="0x40001407">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:nzwidth="0x1" edc:desc="Synchronization Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
